/* Chapter 3 desctructuring */


// 可带默认值，严格undefined时生效
// 对象解构，等号左边，属性名是模式，属性值才是目标标识符
// 对象解构，非初始化赋值，语句需包裹括号
// 对象解构，多层对象的引用关系会被保持
// 字符串解构，可看做字符串数组也可利用String类的属性和方法
// 数字、布尔，不可看做可遍历

// 函数参数结构赋值，参数中接收数组、对象，函数体中拆开使用，
// 可以整体带默认，也可以分别带默认

/* Usage */
// 1.交换变量新写法
// 2.拆分函数返回值
// 3.拆参数
// 4.拆JSON
// 5.函数默认参数








// let [a, [[b], c]] = [1, [[2], 3]];
// let [ , , third] = ['foo', 'bar', 'baz'];
// var [x, y, ...z] = [6];

// var [x = y, y = 1] = [, 300];

// function add([x, y] = [1,2]) {
//     return x + y;
// }
// console.log(add([3,1]));

let x = 1;
let y = 2;
[x, y] = [y, x];



